#### Q1. List any five functions of the pandas library with execution.

Ans:
1. read_csv()
2. head()
3. tail()
4. describe()
5. groupby()

In [1]:
import pandas as pd

df = pd.read_csv('services.csv')

In [8]:
df.head(1)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN

In [9]:
df.tail(1)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [10]:
df.describe()

             id  location_id  program_id
count  23.00000    23.000000         0.0
mean   12.00000    11.956522         NaN
std     6.78233     6.711444         NaN
min     1.00000     1.000000         NaN
25%     6.50000     6.500000         NaN
50%    12.00000    12.000000         NaN
75%    17.50000    17.500000         NaN
max    23.00000    22.000000         NaN

In [21]:
df2 = df.groupby("location_id")
print(df2.sum())

             id  program_id
location_id
1             1         0.0
2             2         0.0
3             3         0.0
4             4         0.0
5             5         0.0
6             6         0.0
7             7         0.0
8             8         0.0
9             9         0.0
10           10         0.0
11           11         0.0
12           12         0.0
13           13         0.0
14           14         0.0
15           15         0.0
16           16         0.0
17           17         0.0
18           18         0.0
19           19         0.0
20           20         0.0
21           21         0.0
22           45         0.0

/tmp/ipykernel_84/2106170839.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(df2.sum())

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [70]:
import pandas as pd

df = pd.DataFrame({'A': [546, 34562, 453], 'B': [54, 56, 65], 'C': [657, 5468, 956]})

new_index = [i for i in range(1, 2*len(df)+1, 2)]

df2 = df.reindex(new_index, fill_value = 0)

df2

       A   B     C
1  34562  56  5468
3      0   0     0
5      0   0     0

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

##### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [105]:
import pandas as pd

def sum_first_three(df):
    sum = 0
    for i, row in df.iterrows():
        sum += row['Values']
        if i == 2:
            break
    print("Sum of first three values:", sum)

df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
sum_first_three(df)

Sum of first three values: 60

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [103]:
import pandas as pd

df = pd.DataFrame({'Text': ['Bhupesh singh rathore', 'The World is so beautiful', 'JMD Lets Rock']})

df['Word_Count'] = df['Text'].apply(lambda x: len(x))

df

                        Text  Word_Count
0      Bhupesh singh rathore          21
1  The World is so beautiful          25
2              JMD Lets Rock          13

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans:
size(): Return an int representing the number of elements in this object.

df.shape(): Return a tuple representing the dimensionality of the DataFrame.

#### Q6. Which function of pandas do we use to read an excel file?

Ans: pd.read_excel()

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

##### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [97]:
import pandas as pd

df = pd.DataFrame({'Email': ['bhupi.rathore@test.com', 'suman@mail.com', 'trilok@example.com']})

df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])

df

                    Email       Username
0  bhupi.rathore@test.com  bhupi.rathore
1          suman@mail.com          suman
2      trilok@example.com         trilok

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
##### For example, if df contains the following values:
##### A B C
##### 0 3 5 1
##### 1 8 2 7
##### 2 6 9 4
##### 3 2 3 5
##### 4 9 1 2
##### Your function should select the following rows: A B C
##### 1 8 2 7
##### 4 9 1 2
##### The function should return a new DataFrame that contains only the selected rows.

In [95]:
import pandas as pd

df = pd.DataFrame({"A": [3, 8, 6, 2, 9],
                  "B": [5, 2, 9, 3, 1],
                   "C": [1, 7, 4, 5, 2]
                  })

df1 = df[(df['A'] > 5) & (df['B'] < 10)]
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [88]:
import pandas as pd

def calc(df):
    mean = df["Values"].mean()
    median = df["Values"].median()
    stdDev = df["Values"].std()
    
    return mean, median,stdDev

df = pd.DataFrame({"Values": [2, 4, 6, 7, 89, 23]})
mean, median,stdDev = calc(df)
print(f"mean: {mean}, median: {median}, and standard deviation: {stdDev}")

mean: 21.833333333333332, median: 6.5, and standard deviation: 33.74858021705012

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [81]:
import pandas as pd

df = pd.DataFrame({'Date': ['2023-03-01', '2023-03-02', '2023-03-03', '2023-03-04', 
                            '2023-03-05', '2023-03-06', '2023-03-07', '2023-03-08', 
                            '2023-03-09', '2023-03-10'], 
                   'Sales': [10,80, 30, 90, 50, 60, 20, 70, 40, 100]})

df['Date'] = pd.to_datetime(df['Date'])

df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

df

        Date  Sales  MovingAverage
0 2023-03-01     10      10.000000
1 2023-03-02     80      45.000000
2 2023-03-03     30      40.000000
3 2023-03-04     90      52.500000
4 2023-03-05     50      52.000000
5 2023-03-06     60      53.333333
6 2023-03-07     20      48.571429
7 2023-03-08     70      57.142857
8 2023-03-09     40      51.428571
9 2023-03-10    100      61.428571

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

##### For example, if df contains the following values:
##### Date
##### 0 2023-01-01
##### 1 2023-01-02
##### 2 2023-01-03
##### 3 2023-01-04
##### 4 2023-01-05
##### Your function should create the following DataFrame:

##### Date Weekday
##### 0 2023-01-01 Sunday
##### 1 2023-01-02 Monday
##### 2 2023-01-03 Tuesday
##### 3 2023-01-04 Wednesday
##### 4 2023-01-05 Thursday
##### The function should return the modified DataFrame.

In [74]:
import pandas as pd

df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-01'],
                   'Value': [10, 20, 30, 40]})

df['Date'] = pd.to_datetime(df['Date'])

df['Weekday'] = df['Date'].dt.day_name()

df

        Date  Value    Weekday
0 2023-01-01     10     Sunday
1 2023-01-15     20     Sunday
2 2023-01-31     30    Tuesday
3 2023-02-01     40  Wednesday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [72]:
import pandas as pd

df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15', '2023-01-31', '2023-02-01'],
                   'Value': [10, 20, 30, 40]})

df['Date'] = pd.to_datetime(df['Date'])

bw = (df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')

selected_rows = df.loc[bw]

selected_rows

        Date  Value
0 2023-01-01     10
1 2023-01-15     20
2 2023-01-31     30

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

Ans: Importing "pandas" is the foremost requirement.